Repository: tommasodargenio/wp-riotd
Catalog: languages/wp-riotd-*.po
Languages: it_it

source: Using the main shortcode: <code>[%1$s]</code> will create a rectangular box where the image, title, subreddit channel will be displayed.
it_it: Utilizzando lo shortcode principale: <code>[%1$s]</code> il plugin creerà un riquadro rettangolare dove verranno visualizzati l'immagine selezionata, il suo titolo, il canale Reddit da cui è stata prelevata

source: View Cache Content
it_it: Contenuto della cache

source: We do not collect or store any personal or usage information, the data fetched from Reddit is publicly available and exported via Reddit JSON RSS feed.
it_it: Non raccogliamo o memorizziamo alcun dato personale o statistiche di utilizzo, i dati prelevati da Reddit sono disponibili publicamente ed esportati tramite i sistemi RSS di Reddit in formato JSON.

source: We strongly suggest to not modify the plugin files directly as any successive updates will overwrite your customization, use the override mechanism provided via the settings menu as this will not be touched during an upgrade and are stored in your WordPress database.
it_it: Ti consigliamo di non modificare direttamente i file del plugin poiché eventuali aggiornamenti successivi sovrascriveranno la tua personalizzazione, utilizza il sistema fornito tramite il menu delle impostazioni in quanto questo non verrà toccato durante l'aggiornamento e verrà memorizzato nel database sul tuo sito.

source: We would love to hear any feedback and constructive criticisms that could help us improve this plugin and create new one, feature requests will be assessed based on the project's roadmap and mission statement and feedback provided if we decide to implement it or else.
it_it: Ci piacerebbe ricevere feedback e critiche costruttive che potrebbero aiutarci a migliorare questo plugin e crearne di nuovi, decideremo di implementare le richieste di altre funzionalità in base al calendario e lo scopo del progetto e al feedback fornito.

source: we'll respond to that as soon as possible
it_it: risponderemo al più presto possibile

source: Welcome
it_it: Benvenuti

source: where parameter is the field you want to extract from the plugin, you can choose from the following list of available data
it_it: dove il parametro è il data che vuoi estrarre dal database, puoi scegliere dalla lista di dati disponibili di seguito

source: Whether you own a subreddit channel and wants to showcase the images posted, or you are passionate about some of the many topics discussed in a subreddit and wants to show some images from there in your posts or your website
it_it: Sia che tu possieda un canale Reddit e desideri mostrare le immagini pubblicate, sia che tu sia appassionato di alcuni dei tanti argomenti discussi in uno dei canali di Reddit e desideri mostrare alcune immagini prese da lì nei tuoi post o nel tuo sito web

source: While the CSS styling built-in with this plugin is compatible in color palette and style with the default WordPress theme Twenty Twenty-One, it might not be of your liking or it could not work with your theme of choice.
it_it: Anche se lo stile CSS interno utilizzato dal plugin usa colori e stili compatibili col tema standard di WordPress (Venti Ventuno al momento del rilascio di questo plugin), potrebbe non piacerti o potrebbe non funzionare col tuo tema.

source: Would you have any issue with the plugin, or if you want to request a new feature to be implemented, please open a new ticket on our <a href="%1$s" title="Click to open RIOTD github repository in a new tab" target="_blank">GitHub</a> repository
it_it: Se incontri problemi o difetti usando questo plugin, o se vuoi richiedere una nuova funzionalità, ti consiglio di aprire una richiesta sul <a href="%1$s" title="Clicca qui per aprire il repository del plugin sul sito di GitHub in una nuova scheda del tuo browser" target="_blank">repository</a> di GitHub

source: You can affect the information displayed by using the switches in the Theme Layout <a href="%1$s">settings</a> tab.
it_it: Puoi modificare le informazioni visualizzate utilizzando gli interruttori nella scheda <a href="%1$s">impostazioni</a> del layout del tema.

source: Your settings have been updated!
it_it: I tuoi settaggi sono stati aggiornati!
