Repository: tommasodargenio/wp-riotd
Catalog: languages/wp-riotd-*.po
Languages: it_it

source: %1$s comments
it_it: %1$s commenti

source: %1$s upvotes
it_it: %1$s voti

source: A boolean value (either true or false) indicating if the image is marked as NSFW (i.e.: adult content) or not
it_it: Un valore booleano (vero o falso) che indica se l'immagine è adatta a soli adulti (NSFW) o no

source: About Us
it_it: Chi siamo

source: Acknowledgements
it_it: Riconoscimenti

source: Add link to reddit post?
it_it: Aggiungi il link al post di reddit?

source: All data is stored on your Website at all time (in the wp_options table within the WordPress database), the lifetime of the data within this table is limited and it can be purged at anytime by using the control in the <a href="%1$s">general settings</a> area
it_it: Tutti i dati sono memorizzati sul tuo sito web (nella tabella wp_options del database di WordPress), la vita dei dati in questa tabella è limitata e possono essere cancellati in ogni momento usando l'apposito bottone nella pagina dei <a href="%1$s">settaggi generali</a>

source: Allow NSFW content
it_it: Consenti contenuto per adulti (NSFW)

source: Allow to download and show images marked as Not Safe For Work (i.e.: adult content)
it_it: Consenti di scaricare e visualizzare immagini indicate come non sicure (es.; contenuti per adulti)

source: Allow Zoom on mouse over
it_it: Consenti zoom al passaggio del mouse

source: Although a lot of care has gone into thoroughly testing this plugin, we couldn't possibly cover all cases and different setup scenario, so please bear with us while we improve and fix any issues that you will report.
it_it: Anche se è stata usata molta nel testare questo plugin, sarebbe stato difficile coprire tutti i casi e vari scenari, vi chiediamo pertanto di portare pazienza mentre apportiamo migliorie e risolviamo i probemi che ci riporterete

source: and
it_it: e

source: and %s seconds
it_it: e %s secondi

source: Author and License
it_it: Autore e Licenza

source: based on criteria you can setup in the settings, you can choose between two layout or simply grab the image url and use it anywhere you want.
it_it: basato sui criteri settati nella configurazione, puoi scegliere tra 3 schemi o semplicemente estrarre l'indirizzo dell'immagine e gli altri dati a disposizione ed usarli dove e come vuoi.

source: beware that shortcodes might not be processed in posts' excerpts but only in full posts depending on how your wordpress theme has been developed.
it_it: attenzione che gli shortcodes potrebbero non essere elaborati nei sommari dei post, ma solo nei post interi. Questo dipende da come il tuo tema di WordPress è stato sviluppato.

source: Cache Content
it_it: Contenuto della cache

source: Cache duration
it_it: Durata della cache

source: Cache Expires in:
it_it: La cache scadrà in:

source: Cache not created yet or expired
it_it: Cache ancora non creata o scaduta

source: Cache purged
it_it: Cache cancellata

source: Cache status
it_it: Stato della cache

source: Can't find the scraper class
it_it: La classe scraper non può essere trovata

source: channel empty
it_it: canale vuoto

source: Click here to close or anywhere outside the image
it_it: Clicca qui o ovunque fuori dalla finestra per chiudere l'immagine

source: Click to clear the cache
it_it: Clicca qui per pulire la cache

source: Click to open in a new tab
it_it: Clicca per aprire questa pagina in una nuova scheda del tuo browser

source: Click to open the post with this image on reddit
it_it: Clicca per aprire il post su Reddit che contiene questa immagine

source: Click to open the post's author reddit profile in a new tab
it_it: Clicca per aprire il profile su Reddit dell'autore di questo post in una nuova scheda del tuo browser

source: Click to open the subreddit channel
it_it: Clicca per aprire il canale di Reddit in una nuova scheda sul tuo browser

source: Click to open this reddit channel in a new tab
it_it: Clicca per aprire il canale di Reddit in una nuova scheda sul tuo browser

source: Click to reset all settings to default
it_it: Clicca per reimpostare tutti i settaggi ai valori predefiniti

source: Click to see a preview
it_it: Clicca per vedere un'anteprima

source: Click to see the content of the cache stored in the database
it_it: Clicca per vedere il contenuto della cache memorizzata nel database

source: Configure Reddit Channel
it_it: Configura il canale di Reddit

source: Copy and paste this shortcode directly into the page, post or widget where you'd like to display the feed
it_it: Copia ed incolla questo shortcode direttamente nella pagina, nel post o nel widget dove vuoi venga visualizzata l'immagine

source: Copy and paste this shortcode directly into the page, post or widget where you'd like to display the requested data
it_it: Copia ed incolla questo shortcode direttamente nella pagina, nel post o nel widget dove vuoi vengano visualizzati i dati richiesti

source: Custom CSS
it_it: Stili (CSS) personalizzati

source: Data Extraction shortcode
it_it: Shortcode per l'estrazione dei dati

source: Data Privacy and GDPR
it_it: Riservatezza dei dati e GDPR

source: day
it_it: giorno

source: Days
it_it: Giorni

source: days
it_it: giorni

source: Debug Checkup
it_it: Controllo di Debug

source: Description
it_it: Descrizione

source: Disclaimer
it_it: Avvertenze

source: Display a piece of data
it_it: Visualizza un dato

source: Display a random image from a reddit channel of your choice on your WordPress website with RIOTD
it_it: Con RIOTD visualizza un'immagine a caso da un canale Reddit di tua scelta sul tuo sito WordPress

source: Display author's name
it_it: Visualizza il nome dell'autore

source: Display channel's name
it_it: Visualizza il nome del canale

source: Display image's title
it_it: Visualizza il titolo dell'immagine

source: Display the author's name in the caption
it_it: Visualizza il nome dell'autore nella didascalia

source: Display the feed
it_it: Visualizza il contenuto (feed)

source: Display the image's title
it_it: Visualizza il titolo dell'immagine

source: Display the subreddit channel's name in the header title?
it_it: Visualizza il nome del canale Reddit nella testata?

source: Download a random image from any subreddit and display it in your WordPress site
it_it: Scarica un'immagine a caso da un canale di Reddit e visualizzala sul tuo sito WordPress

source: Download limits
it_it: Limite di scarico

source: Example
it_it: Esempio

source: Expired
it_it: Scaduta

source: from
it_it: da

source: Full
it_it: Pieno

source: Galleries and Videos will not be selected
it_it: Gallerie e Video non verranno selezionati

source: General Settings
it_it: Settaggi Generali

source: Good ratings and constructive feedbacks encourages me to further develop the plugin and to provide support. Thanks!
it_it: Buone valutazioni e critiche costruttive mi incoraggiano a sviluppare ulteriormente il plugin e fornire support. Grazie!

source: Help and Support
it_it: Aiuto e Supporto

source: Hide Cache Content
it_it: Nascondi Cache

source: hour
it_it: ora

source: Hours
it_it: Ora

source: hours
it_it: ore

source: How To Use
it_it: Come si usa

source: How to use the plugin
it_it: Come usare il plugin

source: I owe a great deal to my partner Aisling who supported me throughout the development of this and other crazy ideas, and who helped me overcome the fear of publishing and releasing this work to the public.
it_it: Devo molto alla mia dolce metà Aisling, che mi ha supportato durante lo sviluppo di questa e altre idee folli e che mi ha aiutato a superare la paura di pubblicare e rendere pubblico questo lavoro.

source: I'd really appreciate it, if you could rate and review the plugin in the WordPress Plugin Directory.
it_it: Mi farebbe molto piacere, se potresti votare e lasciare una recensione nella Galleria dei Plugins di WordPress

source: If enabled the plugin will use its own CSS styling, otherwise you can override the css classes with your own styling
it_it: Se abilitato, il plugin utilizzerà lo stile interno (CSS) predefinto, altrimenti puoi scegliere di modificare le classi CSS col tuo stile

source: If enabled, the image will have a link to the related reddit post, this will open in a new tab
it_it: Se abilitato, l'immagine avrà un link diretto al relativo post su reddit, questo si aprirà in una nuova scheda di Reddit

source: If enabled, when the mouse is over the image it will overlay a window with the image in a bigger resolution.
it_it: Se abilitato, quando il mouse passerà sopra l'immagine, si sovrapporrà una finestra con l'immagine in una risoluzione maggiore.

source: Image aspect
it_it: Formato immagine

source: Image Cache
it_it: Cache dell'imagine

source: Image Preferences
it_it: Preferenze per l'immagine

source: Image scraping mode
it_it: Modalità di selezione dell'immagine

source: Images not stored on Reddit but on 3rd party hosting sites will not be selected
it_it: Le immagini non memorizzate su Reddit ma su siti di terze parti non verranno selezionate

source: In such case you can disable the plug-in CSS with the toggle in the <a href="$1%s">setting</a> page, and override the CSS classes we use with your own styling.
it_it: In questo caso puoi disabilitare lo stile (CSS) interno del plugin con l'apposito bottone nella pagina dei <a href="$1%s">settaggi</a>, e rimpiazzare le classi CSS che utlizziamo con le tue.

source: Indicate if you want to change image every load (random), or use the same daily, or always use the last uploaded (this may change throughout the day)
it_it: Indica se vuoi cambiare immagine ogni volta che la pagina viene caricata (casuale), o usare la stessa immagine ogni giorno (giornaliera), o usare sempre l'ultima immagine caricata (questa potrebbe cambiare durante il giorno)

source: Indicate the max height of the image
it_it: Indica l'altezza massima dell'immagine

source: Indicate the max width of the image
it_it: Indica la larghezza massima dell'immagine

source: It involves using shortcodes (specific keywords contained in square brackets, read more <a href="https://wordpress.com/support/shortcodes/" title="open the wordpress support web page in a new tab" target="_blank">here</a>)
it_it: Implica l'uso di shortcodes (parole chiavi specifiche racchiuse da parentesi quadre, leggi più informazioni <a href="https://wordpress.com/support/shortcodes/" title="Clicca per aprire la pagina di supporto sul sito di WordPress in una nuova scheda del tuo browser" target="_blank">qui</a>)

source: It is licensed as Free Software under GNU General Public License 3 (GPL 3)
it_it: È concesso in licenza come Software Libero sotto GNU General Public License 3 (GPL 3)

source: Landscape
it_it: Panorama

source: Last posted
it_it: Postata ultimamente

source: Layout mode
it_it: Tipo di design

source: Like the plugin? Spread the love!
it_it: Ti piace il plugin? Condividi con i tuoi contatti!

source: Max image height
it_it: Massima altezza dell'immagine

source: Max image width
it_it: Massima larghezza dell'immagine

source: Minimalistic
it_it: Minimalista

source: minute
it_it: minuto

source: Minutes
it_it: Minuti

source: minutes
it_it: minuti

source: must be between %1$s and %2$s
it_it: deve essere tra %1$s e %2$s

source: No direct script access allowed!
it_it: Accesso diretto non consentito!

source: No images availabe :(
it_it: Nessuna immagine disponibile :(

source: Operation aborted
it_it: Operazione abortita

source: Operation non authorized
it_it: Operazione non autorizzata

source: Operation not completed
it_it: Operazione non completata

source: parameter
it_it: parametro

source: Please check the <a href="%1$s">How to use</a> page for usage instructions, would you need help or support you can open an issue on our GitHub <a href="%2$s" target="_blank" title="Click to open the github repo in a new tab">repository</a>
it_it: Si prega di consultare la pagina <a href="%1$s">Come si usa</a> per le istruzioni all'uso, se hai bisogno di aiuto o support puoi aprire una richiesta sul nostro <a href="%2$s" target="_blank" title="Clicca qui per aprire il repository su GitHub in una nuova scheda del tuo browser">repository</a> su GitHub

source: Please provide this information in bug and support requests
it_it: Si prega di fornire queste informazioni nelle richieste di difetti e supporto

source: Plugin Activation Date
it_it: Data di attivazione del plugin

source: Portrait
it_it: Ritratto

source: Preview
it_it: Anteprima

source: Purge Cache
it_it: Cancella la cache

source: Random
it_it: Casuale

source: Reddit Branding
it_it: Identità d'immagine di Reddit

source: Reddit Channel
it_it: Canale di Reddit

source: Reddit channel not specified
it_it: Canale di Reddit non specificato

source: Reddit Image of The Day
it_it: Immagine del giorno da Reddit

source: Reddit image of the day
it_it: Immagine del giorno da Reddit

source: Reddit Inc. has the ownership of the post from which the image has been fetched, please refer to <a href="https://www.redditinc.com/policies/privacy-policy" target="_blank" title="Click to open the reddit website privacy policy page in a new tab">Reddit</a> privacy policies for more information on how this data is treated.
it_it: Reddit Inc. mantiene la proprietà del post da cui l'immagine è stata scaricata, per maggiori informazioni su come i dati riservati sono tratti si prega di far riferimento alle regole sulla riservatezza dei dati di <a href="https://www.redditinc.com/policies/privacy-policy" target="_blank" title="Clicca qui per aprire la pagina sul trattamento dei dati riservato sul sito di Reddit in una scheda del tuo browser">Reddit</a>

source: Reddit is a copyright of Reddit Inc., please refer to Reddit user agreement <a href="https://www.redditinc.com/policies/user-agreement" target="_blank" title="Click to open the reddit website user agreement page in a new tab">website</a> for further details
it_it: Reddit è proprietà di Reddit Inc., per maggiori informazioni si prega di far riferimento al contratto utente sul sito di <a href="https://www.redditinc.com/policies/user-agreement" target="_blank" title="Clicca per aprire la pagina web del contratto utente di Reddit in una scheda del tuo browser">Reddit</a>

source: Reddit returned an unexpected result, check your settings
it_it: Reddit ha risposto con un risultato inaspettato, ricontrolla i tuoi settaggi

source: Reddit URL not defined
it_it: Indirizzo web di Reddit non definito

source: Reset All Settings
it_it: Ripristina tutti i settaggi

source: RIOTD Reddit Image Of The Day
it_it: RIOTD Immagine del giorno da Reddit

source: Same daily
it_it: Stessa giornaliera

source: Save Settings
it_it: Salva i settaggi

source: second
it_it: secondo

source: seconds
it_it: secondi

source: Select the preferred aspect ratio when selecting the image
it_it: Scegli il formato dell'immagine da selezionare

source: Select which layout you prefer. Minimialistic will only show the image, full will show all the available information
it_it: Scegli quale layout preferisci. Minimalista mostrerà solo l'immagine, pieno mostrerà tutte le informazioni disponibili con uno stile interno, Identità d'immagine di Reddit utilizzerà un formato compatibile con le regole di stile dettate da Reddit.

source: Set a download limit, lower numbers results in less images but faster processing
it_it: Imposta un limite di scarico, numeri piccoli risultano in meno immagini disponibili ma più velocità di elaborazione

source: Set a valid subreddit channel you want to download images from
it_it: Imposta un canale di reddit valido da cui vuoi scaricare le immagini

source: Settings
it_it: Settaggi

source: Settings reset successfully
it_it: Settaggi ripristinati con successo

source: Settings saved successfully
it_it: Settaggi salvati con successo

source: Shortcode key parameter
it_it: Parametro

source: Show Preview
it_it: Mostra anteprima

source: Something went wrong while saving the settings, try again later
it_it: Qualcosa non ha funzionato durante il salvataggio dei dati, riprova ancora

source: Styled Shortcode
it_it: Shortcode con stile

source: Support is provided on best-effort basis, please upload screenshots to show the issue, the debug information shown in the column below called Debug Checkup, and any relevant information to help expedite troubleshooting and resolution.
it_it: Il supporto è fornito nel miglior modo possibile, ti prego di fornire immagini catturate dal tuo schermo per mostrare il problema, inoltre fornisci anche le informazioni mostrate nella colonna chiamata Controllo di Debug, e ogni altra informazione pertinente per accelerare la risoluzione del problema.

source: Template not available :(
it_it: Modello non disponibile :(

source: The author username of the post containing the image
it_it: Il nome utente dell'autore del post che contiene l'immagine

source: The cache is empty
it_it: La cache è vuota

source: The code for this plugin is available on my GitHub <a href="%1$s" target="_blank" title="Click to open the github repo in a new tab">repository</a>, feel free to take a peek at it, star it, fork it, and submit pull requests to contribute
it_it: Il codice sorgente di questo plugin è disponibile sul mio repository sul sito di GitHub, sei il benvenuto a dargli un occhio, di aggiungerlo al tuo repository personale (fork), di aggiungerlo tra i tuoi preferiti e di mandarmi richieste per integrare il tuo codice

source: The CSS codes indicated in this box will override the plugin's own CSS styling
it_it: Il codice CSS indicato in questo campo andrà a sovrascrivere lo stile CSS interno del plugin

source: The first step is to setup the plugin, indicating the subdreddit <a href="%1$s">channel</a> you want to fetch images from
it_it: Il primo passo è di configurare il plugin, indicando il <a href="%1$s">canale</a> di Reddit da cui vuoi prendere le immagini

source: The full resolution height in pixels of the image
it_it: L'altezza a piena risoluzione in pixel dell'immagine

source: The full resolution width in pixels of the image
it_it: La larghezza a piena risoluzione dell'immagine

source: The image's content is never analyzed, we rely on Reddit's flags to determine whether or not the image has adult content, you can choose to display such content or not with the related flag (<strong>Allow NSFW content</strong>) in the <a href="%1$s">general settings</a> area
it_it: Il contenuto dell'immagine non viene mai analizzato, ci affidiamo ai settaggi di Reddit per determinare se l'immagine ha o meno contenuti per adulti, puoi scegliere di visualizzare tale contenuto o meno col relativo settaggio (<strong>Consenti contenuto per adulti (NSFW)</strong>) nella pagina dei <a href="%1$s">settaggi generali</a>

source: The plugin comes with some parameters pre-set, however we strongly recommend you to review and change them according to your own need.
it_it: Il plugin è fornito con alcuni parametri preconfigurati, comunque ti raccomandiamo di rivederli e cambiarli in base alle tue esigenze.

source: The plugin do not transfer or send any of the data collected (in its entirity or partially) anywhere outside your website.
it_it: Il plugin non trasferisce o manda nessuno dei dati ottenuti (interamente o parzialmete) al di fuori del tuo sito web.

source: The post from Reddit where the image is selected, contains the username of the post's author which you can choose not to display on your Website.<strong>(always read and respect the author's copyright terms)</strong>
it_it: Il post su Reddit da cui l'immagine è stata selezionata, contiene il nome utente dell'autore del post che puoi scegliere di visualizzare o meno sul tuo sito.<strong>(controlla e rispetta sempre le regole di proprietà espresse dall'autore)</strong>

source: The reddit channel selected is empty or something went wrong during the download
it_it: Il canale Reddit selezionato è vuoto o qualcosa non ha funzionato durante lo scaricamento

source: The second way is to just get the information you are interested to display, instead of using the plugin UI. In this case use the shortcode <code>[%1$s %2$s=&quot;parameter&quot;]</code>
it_it: La seconda modalità serve per ottenere solo le informazioni che vuoi visualizzre, invece che utilizzare l'interfaccia del plugin. In questo caso utilizza lo shortcode <code>[%1$s %2$s=&quot;parametro&quot;]</code>

source: The title or caption of the image as provided by the post's author
it_it: Il titolo o didascalia dell'immagine così come fornita dall'autore del post

source: The url pointing at the full resolution image
it_it: L'indirizzo che punta all'immagine in piena risoluzione

source: The url pointing at the subreddit post containing the image
it_it: L'indirizzo che punta al post su Reddit che contiene l'immagine

source: The url pointing at the thumbnail version of the image
it_it: L'indirizzo che contiene la versione in miniatura dell'immagine

source: Theme Layout
it_it: Layout del tema

source: then the <a href="%1$s">image</a> resolution and aspect ratio, which kind of data you want it <a href="%2$s">displayed</a>
it_it: poi la <a href="%1$s">risoluzione</a> dell'immagine e il suo formato, ed infine quali informazioni vuoi <a href="%2$s">visualizzare</a>

source: There are a couple of ways to display the image feed from the subreddit channel you have specified in the <a href="%1$s">settings</a>
it_it: Ci sono un paio di modi per visualizzare l'immagine scaricata dal canale di Reddit che hai specificato nei <a href="%1$s">settaggi</a>

source: This plugin and its code is provided <em>as-is</em> without warranty of any kind, either express or implied, including any implied warranties or fitness for a particular purpose, merchantibility, or non-infringement
it_it: Questo plugin e il suo codice sorgente vengono forniti <em>così come sono</em> senza garanzie di alcun tipo, esplicite o implicite, comprese eventuali garanzie implicite o idoneità per uno scopo particolare, commerciabilità o non violazione

source: this plugin is for you. It will scrape images from a subreddit channel of your choice, and display it on your website through a text widget or in any of your post where you would use the shortcodes available. The images are fetched
it_it: questo plugin fa per te. Selezionerà un'immagine da un canale di Reddit di tua scelta, e la visualizzerà sul tuoi sito web tramite un widget di testo o in uno qualsiasi dei post o pagine pubblicate sul tuo sito tramite l'uso degli shortcode disponibili. Le immagini sono selezionate

source: This plugin was written and developed by
it_it: Questo plugin è stato scritto e sviluppato da

source: This work has been inspired, painstakingly tested, and refined by my brother. Thanks for all your support and ideas!
it_it: Questo lavoro è stato ispirato, accuratamente testato e perfezionato con l'aiuto di mio fratello. Grazie per tutto il tuo supporto e le tue idee!

source: To copy, click the field than press Ctrl + C (PC) or Cmd + C (Mac)
it_it: Per copiare, clicca sul campo e poi premi Ctrl + C (PC) o Cmd + C (Mac)

source: To my dear and quirky auntie who always encouraged me and nurtured my brain, I always loved the way she used to say goodbye to me: Ad maiora! (to greater things).
it_it: Alla mia carissima e stravagante zia che mi ha sempre incoraggiato e nutrito la mia mente, ho sempre amato il modo in cui mi salutava: Ad maiora! (verso cose più grandi)

source: Unable to load required dependency
it_it: Impossibile caricare le librerie necessarie al funzionamento del plugin

source: Update available, click to refresh
it_it: Aggiornamento disponibile, clicca per aggiornare

source: Usage instructions
it_it: Istruzioni per l'uso

source: Use plugin's css?
it_it: Utilizza gli stili (CSS) interni del plugin?
